In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame({"key1" :["a", "a", "b","b", "a"],
                   "key2" :["one", "two", "one", "two", "one"],
                    "data1": np.random.randn(5),
                    "data2": np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -2.240545  0.710366
1    a  two -1.015065  0.264956
2    b  one -0.670560  1.204996
3    b  two  0.726051 -1.169634
4    a  one  1.684220 -0.428779

In [11]:

grouped = df["data1"].groupby(df["key1"],)

grouped
grouped.mean()

key1
a   -0.011018
b    0.785633
Name: data1, dtype: float64

In [19]:
means = df["data1"].groupby([df["key1"],df["key2"]]).mean()

means
means.unstack()

key2       one       two
key1
a    -0.009409 -0.014237
b    -0.305563  1.876828

In [20]:
sums = df["data1"].groupby([df["key1"],df["key2"]]).sum()

sums
sums.unstack()

key2       one       two
key1
a    -0.018817 -0.014237
b    -0.305563  1.876828

In [22]:
df.groupby("key1").mean()

         data1     data2
key1
a    -0.011018  0.133658
b     0.785633 -0.002550

In [23]:
df.groupby(["key1", "key2"]).mean()

              data1     data2
key1 key2
a    one  -0.009409 -0.335479
     two  -0.014237  1.071932
b    one  -0.305563  0.264962
     two   1.876828 -0.270063

In [24]:
df.groupby(["key1", "key2"]).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [34]:
for name, group in df.groupby("key1"):
    
    print(group)

  key1 key2     data1     data2
0    a  one  0.122184  0.099090
1    a  two -0.014237  1.071932
4    a  one -0.141001 -0.770048
  key1 key2     data1     data2
2    b  one -0.305563  0.264962
3    b  two  1.876828 -0.270063

In [33]:
  for (k1, k2), group in df.groupby(["key1", "key2"]):
        print(group.unstack())

key1   0           a
       4           a
key2   0         one
       4         one
data1  0    0.122184
       4   -0.141001
data2  0     0.09909
       4   -0.770048
dtype: object
key1   1           a
key2   1         two
data1  1   -0.014237
data2  1    1.071932
dtype: object
key1   2           b
key2   2         one
data1  2   -0.305563
data2  2    0.264962
dtype: object
key1   3           b
key2   3         two
data1  3    1.876828
data2  3   -0.270063
dtype: object

In [5]:
import numpy as np
import pandas as pd

df = pd.DataFrame({"key1" :["a", "a", "b","b", "a"],
                   "key2" :["one", "two", "one", "two", "one"],
                    "data1": np.random.randn(5),
                    "data2": np.random.randn(5)})

states = np.array(["Ohio", "California", "California", "Ohio", "Ohio"])
years = np.array([2005, 2005, 2006, 2005, 2005])

df["data1"].groupby([states, years]).mean()

California  2005    0.781187
            2006   -0.143365
Ohio        2005   -0.030327
Name: data1, dtype: float64

In [7]:
df["data1"].groupby(df["key1"]).mean()

key1
a    0.304461
b   -0.183271
Name: data1, dtype: float64

In [8]:
df["data2"].groupby([df["key2"]]).mean()

key2
one    0.213592
two    0.713159
Name: data2, dtype: float64

In [11]:
df.groupby(["key1", "key2"])[["data2"]].mean()

              data2
key1 key2
a    one   0.206756
     two   2.221571
b    one   0.227266
     two  -0.795252

In [10]:
df

  key1 key2     data1     data2
0    a  one -0.738384  0.062853
1    a  two  0.781187  2.221571
2    b  one -0.143365  0.227266
3    b  two -0.223177 -0.795252
4    a  one  0.870580  0.350658

In [17]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns=["a", "b", "c", "d", "e"],
                     index =["Joe", "Steve", "Wes", "Jim", "Travis"])
people

               a         b         c         d         e
Joe    -1.005834  0.796159 -1.335524  0.238577 -1.339400
Steve   0.515749 -0.347644  0.031152 -0.439509 -1.015002
Wes     0.174122 -1.705308 -0.434004 -0.098379 -0.417012
Jim     1.257201  0.818847 -0.492264 -1.802334 -0.070799
Travis -0.557152  1.061983 -0.493294  0.092892 -0.516492

In [23]:
people.iloc[2:3,[1,2]]=np.nan  # Add a few NA values

In [19]:
people

               a         b         c         d         e
Joe    -1.005834  0.796159 -1.335524  0.238577 -1.339400
Steve   0.515749 -0.347644  0.031152 -0.439509 -1.015002
Wes     0.174122       NaN       NaN -0.098379 -0.417012
Jim     1.257201  0.818847 -0.492264 -1.802334 -0.070799
Travis -0.557152  1.061983 -0.493294  0.092892 -0.516492

In [24]:
df

  key1 key2     data1     data2
0    a  one -0.738384  0.062853
1    a  two  0.781187  2.221571
2    b  one -0.143365  0.227266
3    b  two -0.223177 -0.795252
4    a  one  0.870580  0.350658

In [44]:
grouped =  df.groupby("key1")

grouped ["data1"].quantile(0.9)

key1
a    0.852701
b   -0.151347
Name: data1, dtype: float64

In [31]:
grouped["data1"].quantile(0.75)

key1
a    0.825883
b   -0.163318
Name: data1, dtype: float64

In [45]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

grouped.agg(peak_to_peak)

C:\Users\kwasi\AppData\Local\Temp\ipykernel_12820\3026831165.py:4: FutureWarning: ['key2'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.608963  2.158718
b     0.079811  1.022518

In [46]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.304461  0.904235 -0.738384  0.021402  0.781187  0.825883
b      2.0 -0.183271  0.056435 -0.223177 -0.203224 -0.183271 -0.163318

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.870580   3.0  0.878361  1.172121  0.062853  0.206756  0.350658
b    -0.143365   2.0 -0.283993  0.723029 -0.795252 -0.539623 -0.283993


           75%       max
key1
a     1.286115  2.221571
b    -0.028364  0.227266

In [50]:
import numpy as np
import pandas as pd

tips = pd.read_csv("https://github.com/wesm/pydata-book/blob/2nd-edition/examples/tips.csv")

ParserError: Error tokenizing data. C error: Expected 1 fields in line 28, saw 509